# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseArray..::..ForwardIterator Method
PhaseArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual PhaseArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As PhaseArrayIterator
```

Visual C++
---
```text
public:
virtual PhaseArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
PhaseArray Class
Autodesk.Revit.DB Namespace